CITIES = [
    ("Лутовинівка", "Лутовинівці", "Лутовинівки", "Лутовинівку"),
    ("Козельщина", "Козельщині", "Козельщини", "Козельщину"),
    ("Кременчук", "Кременчуку", "Кременчука", "Кременчук"),
    ("Кобеляки", "Кобеляках", "Кобеляк", "Кобеляки"),
    ("Нова Галещина", "Новій Галещині", "Нової Галещини", "Нову Галещину"),
    ("Горішні Плавні", "Горішніх Плавнях", "Горішніх Плавнів", "Горішні Плавні"),
    ("Нові Санжари", "Нових Санжарах", "Нових Санжар", "Нові Санжари"),
    ("Полтава", "Полтаві", "Полтави", "Полтаву"),
    ("Солониця", "Солониці", "Солониці", "Солоницю"),
]
