# (city_name, is_departure, description)
# is_departure=True  → pickup point / departure hint
# is_departure=False → drop-off point / arrival hint

ROUTE_DESCRIPTIONS = [
    ("Лутовинівка",       True, "Стекляшка, сільрада, школа, виїзд на Козельщину"),
    ("Лутовинівка",       True, "Степова, вукс, виїзд на полтавську трасу"),
    ("Лутовинівка",       False, "Школа, сільрада, стадіон"),
    ("Лутовинівка",       False, "Вукс, школа, сільрада, Попаснянка"),

    ("Козельщина",        True,  "Нектар, центр, п‘ятиповерхівки"),
    ("Козельщина",        True,  "Жд, старий суд, верхня заправка"),
    ("Козельщина",        False, "Верхня заправка, центр, школа"),
    ("Козельщина",        False, "П‘ятиповерхівки, Агат, база"),

    ("Кременчук",         True,  "Айсберг, водоканал, жд"),
    ("Кременчук",         True,  "Центральний ринок, жд"),
    ("Кременчук",         True,  "Краз, пивзавод"),
    ("Кременчук",         False,  "Пивзавод, мак, Нова Лінія"),
    ("Кременчук",         False,  "Жд, водоканал, краз"),
    ("Кременчук",         False,  "Жд, центральний ринок, Галактика"),


    ("Полтава",           True,  "Автовокзал Полтава (вул. Зінківська, 3)"),
    ("Полтава",           True,  "ЖД вокзал, центр, Діамант"),
    ("Полтава",           True,  "Половки, Сонячний, об'їзна"),
    ("Полтава",           True,  "ПУЕТ, медакадемія, Корпусний парк"),
    ("Полтава",           False, "Автовокзал Полтава (вул. Зінківська, 3)"),
    ("Полтава",           False, "ЖД вокзал, центр, Діамант"),
    ("Полтава",           False, "Половки, Сонячний, об'їзна"),
    ("Полтава",           False, "ПУЕТ, медакадемія, Корпусний парк"),

    ("Горішні Плавні",    True,  "Центральний майдан (біля ТЦ «Епіцентр»)"),
    ("Горішні Плавні",    False, "Центральний майдан (біля ТЦ «Епіцентр»)"),
    ("Кобеляки",          True,  "Автостанція Кобеляки (вул. Незалежності)"),
    ("Кобеляки",          False, "Автостанція Кобеляки (вул. Незалежності)"),
    ("Нові Санжари",      True,  "Центр селища (вул. Центральна)"),
    ("Нові Санжари",      False, "Центр селища (вул. Центральна)"),

    ("Нова Галещина",     True,  "Центр села (зупинка «Нова Галещина»)"),
    ("Нова Галещина",     False, "Центр села (зупинка «Нова Галещина»)"),

    ("Солониця",          True,  "Зупинка «Солониця» (траса М-22)"),
    ("Солониця",          False, "Зупинка «Солониця» (траса М-22)"),
]
